{"title":"Is the Love Song Dying?","description":"We categorized songs in the Billboard Top 10 to see if love songs are on the decline.","url":"https://pudding.cool/2024/09/love-songs","keywords":"billboard, pop music, love songs","byline":"By <a href=https://pudding.cool/author/david-mora/ target=_blank>David Mora</a> and <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>","bios":{"david":"makes visual explorations of cultural phenomena, like <a href=https://www.youtube.com/watch?v=pAGLlj1sR50 target=_blank>meat</a>,  <a href=https://www.youtube.com/watch?v=6qxD7yV4pZg target=_blank>Olivia Rodrigo</a>, and <a href=https://www.youtube.com/watch?v=XuAysx7kZeU target=_blank>MrBeast</a>. Usually with <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>. And <a href=https://www.youtube.com/watch?v=wvn9-swvmJM target=_blank>sometimes</a> even <a href=https://pudding.cool/author/michelle-pera-mcghee/ target=_blank>Michelle Pera-McGhee</a>.","michelle":"is a writer and <a href=https://mixue.mmm.page/sundogg target=_blank>ethnographic researcher</a> from Toronto. She made an <a href=https://tidal.com/browse/album/365141695?u target=_blank>indie folk album</a>. She <a href=https://sundogg.substack.com/p/positions-part-2 target=_blank>picked apart Ariana Grande</a>. <a href=https://sundogg.substack.com/p/positions-part-2-291 target=_blank>Twice</a>. She makes things with <a href=https://pudding.cool/author/david-mora/ target=_blank>David</a>, who wrote this bio."},"footer":{"heading":"Thanks for reading!","thanks":"We, <a href=https://pudding.cool/author/david-mora/ target=_blank>David Mora</a> and <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>, would like to thank <a href=https://pudding.cool/author/michelle-pera-mcghee/ target=_blank>Michelle Pera-McGhee</a> for guiding us during our original pitch (about lyrical cliches in pop) that eventually became this piece, and <a href=https://pudding.cool/author/matt-daniels/ target=_blank>Matt Daniels</a> for his design and editorial guidance throughout. We would also like to shout-out <a href=https://shirleywu.studio/ target=_blank>Shirley Wu</a>, whose <a href=https://pudding.cool/2017/03/hamilton/ target=_blank>Hamilton piece</a> heavily inspired this piece.","methods":"Nerds: learn about our methods and data.","mobileOnly":"Or, to search through the songs and performers, open this piece on desktop."},"orientationWarningModal":{"paragraphs":["Psst…","This piece is waaay better in <b>landscape orientation</b>, but it looks like <b>your phone is in portrait</b>.","Try rotating your phone!"],"dismissButton":"I’ll take my chances"},"dataMethods":[{"title":"How did you determine the popularity of each song?","paragraphs":["TLDR: popularity = number of weeks in the Billboard Top 10 (does not have to be continuous weeks)","Coming up with a popularity metric was tricky. First, Billboard continuously changed how they chose the rank of the Hot 100. In the ’60s, they loosely polled record stores, and sometimes just switched things up to keep it interesting. Later they started looking at stream count, which measures completely different user behavior (e.g., it takes into account those who listen to songs on repeat, which radio never could).","For example: You might notice that, as time goes on, there seem to be fewer songs, and songs on average spend longer in the Top 10. Are today’s songs just… more popular than ever? Unclear. It’s hard to know how much of this comes from changing listener behavior vs how Billboard measures listener behavior.","The best we can do is compare the relative popularity of a song to songs from the same era. It’s not safe to conclude, say, that Doja Cat’s <span class=song-title>Kiss Me More</span> was more popular than The Beatle’s <span class=song-title>Day Tripper</span> simply because it spent longer on the Top 10. Popularity was measured completely differently for each.","Second, even if Billboard rankings <i>were</i> made consistently, rankings (“ordinal measures,” for the geeks) kinda suck for deriving aggregate, quantitative comparisons. Billboard provides us each song’s rank, but nothing about how close or far one song was from another. For example, in January 2019, was Hasley’s <span class=song-title>Without Me</span> at #1 because it was twice as popular as Ariana’s <span class=song-title>Thank U, Next</span> #2? Or did it barely edge it out?","The data is messy, so we ended up keeping our popularity metric simple: tally the total number of weeks the song was within the Top 10, irrespective of its specific rank. The popularity scores derived from this approach closely correlate with scoring methods that take rank into account, so we felt pretty happy proceeding with it."]},{"title":"How did you decide which of the 5,100 songs were love songs?","paragraphs":["We did a lot of labeling by hand. Once we had a solid approach (see below) and a lot of examples, we <a href=https://github.com/the-pudding/pop-love-songs/blob/main/GPT%20prompt%20used%20to%20label%20love%20song%20types.md target=_blank>wrote a prompt</a> and used GPT4o to label the rest. We iterated a lot on that prompt until it became pretty accurate. By the end, we found GPT made very few mistakes, and most mistakes we did find were simply songs that would have been genuinely ambiguous for a human labeler, as well.","I, David, was honestly very surprised by how accurate GPT4o ended up being, after a lot of experimentation. Eventually, we found that model accuracy was most improved by: (a) in the output, having the model first write a justification before making its final categorization and (b) in the prompt, providing a lot of examples with justifications.","The explanation for this seems related to how LLMs work: since they generate outputs token by token, giving the model space to first “think through” a justification results in a more accurate classification. And, naturally, more examples increased the model’s clarity on our classification system."]},{"title":"[SPOILER ALERT] How did you develop and and then assign your seven love song types?","paragraphs":["I, Michelle, come from a qualitative research background, so we used a process called \"clustering\" to find \"themes\" in a large volume of qualitative data (in this case, music and lyrics). (Mentally, this is a similar process to what happens when Humanities scholars find the themes in a body of literary or philosophical work!)","We started with the most obvious song types -- the Serenade -- and slowly expanded towards types that seemed to defy these, until we had created a collection of themes that seemed to represent the vast majority, if not all of the songs. This process involved going back and forth between our own lived experience of what love songs existed, and testing the framework -- with GPT4o's help -- against the actual data to find exceptions and improve our model. Every time GPT4o came back with labelled data, we combed through by hand to see how much we agreed. The disagreements produced new insights.","Still not satisfied? <i>Ok, here’s a bit more of the details:</i>","At our least structured, we were simply assessing the songs we saw, and adjusting categories to better match them.","At our most structured (and where we tried to start the process), we came up with a matrix made of two metrics. Here it is:","love-song-type-matrix-attempt.png","Here’s how it worked: Given love songs are fundamentally about the romantic dynamics between (at least) two people, the first metric defined the relationship between the speaker and their subject: the speaker has/had feelings toward someone, and they either (a) might love them back, (b) do love them back or (c) don’t love them back (but might have once). The second metric was how traditional the treatment of love was. As you can see, the less traditional love song types often straddle multiple relationship categories.","In the end, we felt the framework was more confusing than helpful, but it helped us land on our ultimate love song categories.","Ultimately, there is no perfect set of categories that could capture the nuance of every love song, and we had to make a lot of interpretive leaps. Many songs straddle the line between two categories, and in those cases, we had to make judgement calls.","<i>For the data nerds</i>:","We did also try looking for clusters in a text embedding of each song’s lyrics. This yielded poor initial results, so we didn’t explore it futher.","Text embedding tended to cluster songs around the literal words and images they used, rather than the meaning or intent behind the words.","For example, while <a href=https://github.com/the-pudding/pop-love-songs/blob/main/GPT%20prompt%20used%20to%20label%20love%20song%20types.md target=_blank>our ChatGPT prompt</a> was able to correctly place <span class=song-title>Urgent</span> by Foreigner into the category <span class=sexual-confidence>Sexual Confidence</span>, text embedding failed to cluster it with other such songs because it consists largely of innuendo (eg “That's why you call me in the middle of the night / You say it's urgent”).","The prevalence of songs like <span class=song-title>Urgent</span> -- which are thematically related but textually quite different from other songs like <span class=song-title>WAP</span> -- made LLMs a better choice than text embedding. Or maybe I, David, just need to get better at embedding and clustering 🤷."]},{"title":"Besides what you did by hand and with an LLM, where did you get your data?","paragraphs":["From <a href=https://github.com/utdata/rwd-billboard-data/blob/main/data-out/hot-100-current.csv target=_blank>this scrape of weekly Billboard Hot 100 rankings</a> we looked at songs from 1959 - September 2023 (the cutoff date was chosen to be safety within the window that OpenAI’s GPT4o was trained on). There are 5,141 unique songs.","We used GPT to split out individual artist artists from the credit of each song. We merged some names where there was variation in the same artist’s name or spelling (eg Jay-Z and JAY-Z)."]},{"title":"Could I just download all the data?","paragraphs":["DATA_DOWNLOAD_BUTTON: For sure."]}],"dataDownloadButtonFlag":"DATA_DOWNLOAD_BUTTON:","dataDownloadFileName":"Love song categories for Billboard Top 10 hits, 1958 - September 2023, from The Pudding","commentText":{"boomerBobComment":"They don't make love songs like they used to… Nowadays it's just sex, drugs and me me me!!!","alternate":"They don’t make love songs like they used to… No cussing, no nudity, just pure talent!"},"stepText":{"haveYouSeenTheseYouTubeComments":{"copy":"Have you ever seen a comment like this? Boomer Bob is pointing to a growing sentiment: that something about contemporary music is in decline.","figCaption":""},"boomerBobSaysLoveSongsAreDying":{"copy":"This Baby Boomer-centric sentiment seems to crystallize around one topic in particular: modern pop music’s treatment of love and romance—or the lack thereof. According to Boomer Bob, the love song is dying. But is it true? Let’s investigate...","figCaption":""},"titleCard":{"copy":"","figCaption":""},"allTheBillboardHitsInAMonoChromeCluster":{"copy":"Here are all 5,100 Billboard Top 10 hits from 1958 to September 2023. Each bubble <span class=in-text-bubble-example></span> is a song. The bigger the bubble, the longer it spent in the Top 10. <button class=modalTrigger>Learn more about our methods.</button>","figCaption":"All five thousand one hundred Billboard Top 10 hits from 1958 to September 2023 represented as randomly distributed bubbles, each sized by how long it spent in the Top 10. Four songs are labeled."},"highlightSerenadesWithinCluster":{"copy":"These are the 1,040 Top 10 hits we think Boomer Bob would <i>definitely</i> consider love songs. They’re all unmistakably about romantic love and devotion, sung from one person to another. Let’s call these <span class=serenade>Serenades</span>.","figCaption":"Highlighting the one thousand and forty classic love songs, also called “Serenades,” within the five thousand Billboard Top 10 hits, all represented as randomly distributed bubbles, with four playable love songs annotated."},"serenadesAreIndeedDying":{"copy":"If you spread these <span class=serenade>Serenades</span> on a timeline, they <i>do</i> appear to decline… but by how much?","figCaption":"All one thousand Serenade category love songs spread across a horizontal timeline from 1958 to 2023, appearing to peak in total popularity in the 1990s before substantially decreasing. Three songs are labeled."},"anAggSnakeChartMakesBoomerBobSeemRight":{"copy":"To see, here are the <span class=serenade>Serenades</span> compared to <span class=not-a-love-song>all other Billboard Top 10 hits</span>. The proportion of love songs in the 1960s was <b>23%</b>. In the 2020s, it’s <b>12%</b>. The proportion of love songs has almost halved! So, was Boomer Bob right? Are love songs, in fact, dying?","figCaption":"Chart of the proportion of songs that are Serenades vs all other songs, where Serenades decrease from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s, dropping most sharply after the 1990s."},"butWeWillTakeAMoreExpansiveView":{"copy":"Not quite: we think Boomer Bob has too narrow a view of love. Sure, these lovey-dovey tunes have declined. But what about other songs? What about Adele’s <span class=song-title>Someone Like You</span>? Or T-Pain’s <span class=song-title>Buy U A Drank</span>? Or <span class=song-title>WAP</span>? If we look more closely, we uncover a story that will change how you see love in pop music.","figCaption":"Chart of the proportion of songs that are Serenades vs all other songs, where each song is an individual bubble, with three playable songs annotated that relate to love but do not fit into the Serenade category."},"definingSerenades":{"copy":"Earlier we showed you the most obvious form of love songs, the <span class=serenade>Serenade</span>. These songs describe a simple relationship: you love someone, and they love you back!","figCaption":"Chart of the proportion of songs that are Serenades vs all other songs, where each song is an individual bubble, with three playable Serenade category love songs annotated."},"colorInHeartache":{"copy":"But what happens if you love them, but they just... don’t? Maybe you broke up, or maybe it’s just unrequited. Let’s call this type of love song <span class=heartache>Heartache</span>.","figCaption":"Chart of the proportion of songs that are Serenades vs all other songs, where each song is an individual bubble, but Heartache songs have been highlighted within the non-Serenade songs. Three playable Heartache category love songs are annotated."},"introducingHeartache":{"copy":"<span class=performer>Taylor Swift and Mariah Carey, ever the love-lorn crooners, top the <span class=heartache>Heartache</span> category. <span class=desktop-only>(Explore all the artists with the search bar, where they’re sorted by how many of their songs fall in this category.)</span>","figCaption":"All eight hundred and thirty Heartache category love songs spread across a horizontal timeline from 1958 to 2023, appearing to remain fairly constant in popularity over time. Three playable songs are labeled."},"heartacheComparedToSerenade":{"copy":"The total number of Top 10 spots occupied by <span class=heartache>Heartache</span> surpassed <span class=serenade>Serenades</span> in the 2020s. <span class=song-title>Blinding Lights</span> by The Weeknd played a big role, spending 57 weeks in the Top 10. Note: for each decade, love song types are sorted vertically by popularity (which is why <span class=heartache>Heartache</span> jumps above <span class=serenade>Serenades</span> in the 2020s).","figCaption":"Chart of the proportion of songs that are Serenades, Heartache and all other songs, where each song is an individual bubble. One playable Heartache category love song is annotated."},"heartacheDoNotTipTheScales":{"copy":"Did adding <span class=heartache>Heartache</span> save the love song? Nope! Their decline is still dramatic: from <b>45%</b> of all songs in the ’60s, to <b>27%</b> in the 2020s.","figCaption":"Chart of the proportion of love songs (with Heartache included) vs all other songs, where the total popularity of all love songs decreases from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s, dropping most sharply after the 1990s."},"introducingPursuit":{"copy":"But we’re just getting started... How about when you love someone, and it  <i>might </i> become something more? You just spotted someone, your heart is beating fast, and who KNOWS where this thing might lead? It might be time for a little <span class=pursuit>Pursuit</span>.","figCaption":"All four hundred and forty Pursuit category love songs spread across a horizontal timeline from 1958 to 2023, appearing to remain fairly constant in popularity over time. Three playable songs are labeled."},"pursuitHasNoEffect":{"copy":"These <span class=pursuit>Pursuit</span> songs remain fairly steady over time, so the love song is still in decline and Boomer Boomer Bob remains right. I mean, what aspects of love could you sing about beyond <span class=pursuit>new love</span>, <span class=serenade>true love</span>, and <span class=heartache>heartbreak</span>?","figCaption":"Chart of the proportion of love songs (with Pursuit included) vs all other songs, where the total popularity of all love songs decreases from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s, dropping most sharply after the 1990s."},"introducingItsComplicated":{"copy":"From our perspective: a lot, if you’re willing to explore the messier side of romance. What about when a relationship isn’t clearly good <i>or</i> bad? Maybe you fight constantly. Maybe they’re unfaithful. But you still try to make it work, because... well, <span class=\"its-complicated\">It's Complicated</span>!","figCaption":"All four hundred and eighty It’s Complicated category love songs spread across a horizontal timeline from 1958 to 2023, steadily increasing in popularity over time. Three playable songs are labeled."},"itsComplicatedDoesNotTipTheScales":{"copy":"Can this angsty genre save the love song? No, but we’re getting closer!","figCaption":"Chart of the proportion of love songs (with It’s Complicated included) vs all other songs, where the total popularity of all love songs decreases from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s."},"introducingGoodRiddance":{"copy":"What about those songs where the relationship  <i>is </i> clearly over, but the songwriter’s heartbreak has resurrected into... righteous power? They’re not crying, they’re yelling “<span class=\"good-riddance\">Good Riddance</span>!”","figCaption":"All one hundred and twenty five Good Riddance category love songs spread across a horizontal timeline from 1958 to 2023, largely increasing in popularity starting in the 2000s. Three playable songs are labeled."},"goodRiddanceDoesNotTipTheScale":{"copy":"With the predominantly modern <span class=\"good-riddance\">Good Riddance</span> love song added to the mix, maybe love is not dead -- it’s just a little wounded.","figCaption":"Chart of the proportion of love songs (with Good Riddance included) vs all other songs, where the total popularity of all love songs decreases from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s."},"introducingSexualConfidence":{"copy":"What about songs that get a little steamy? Think artists like Nicki Minaj and Drake, who dominate this category that's all about getting into bed with someone. Ah, the <span class=\"sexual-confidence\">Sexual Confidence</span>!","figCaption":"All three hundred and ten Sexual Confidence category love songs spread across a horizontal timeline from 1958 to 2023, generally increasing starting in the 1980s, with a spike in the 1990s. Three playable songs are labeled."},"sexualConfidenceInContext":{"copy":"As Boomers bemoan, these <span class=\"sexual-confidence\">Sexual Confidence</span> songs exploded in popularity, nearly eclipsing the Serenade in the 2000s. When we include this sensual side of love, the love song isn’t dying after all, but  just as popular as in Boomer Bob’s day! But we’re not done quite yet.","figCaption":"Chart of the proportion of love songs (with Sexual Confidence included) vs all other songs, where the total popularity of all love songs increases slightly from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s. Sexual Confidence is the second most popular love song category in the 1990s, but is otherwise one of the least popular categories."},"introducingLoveSongForTheSelf":{"copy":"We’ve ventured  <i>very</i> far from the <span class=serenade>Serenade</span>. Far enough to find its reincarnation: songs where heartbreak turns love back onto the OG, yourself. “You don't love me? That’s ok, because I do! In fact, I’ll buy <i>myself</i> flowers…”","figCaption":"All one hundred and ten Love Song for the Self category love songs spread across a horizontal timeline from 1958 to 2023, generally sparse until the 2000s. Three playable songs are labeled."},"didLoveSongForTheSelfTipTheScales":{"copy":"This women-pioneered <span class=\"love-song-for-the-self\">Love Song for the Self</span> is the most modern of all the genres. And while it’s not written <i>to</i> a lover, it’s often written in <i>reaction to</i> romantic rejection. So now let’s return to our central question: Is the love song dying?","figCaption":"Chart of the proportion of love songs (with Love Song for the Self highlighted) vs all other songs, where Love Song for the Self is relatively obscure before increasing suddenly in the 2000s and finishing as the fifth most popular love song category in the 2020s, out of all seven categories."},"theLoveSongIsActuallyRising":{"copy":"Not at all. In fact, it’s increasingly <b>more popular</b>! The love song didn’t die; it evolved. People are loving, losing, and connecting in more ways than ever before. We argue that <b>modern pop is just as love-struck as ever</b>, just maybe in ways that Boomer Bob doesn’t recognize.","figCaption":"Chart of the proportion of love songs vs all other songs, where the total popularity of all love songs increases from SIXTIES_PERCENT% in the 60s to MODERN_PERCENT% in the 2020s. Individual love songs are now grouped into one aggregate category, emphasizing how the love songs have increased over time."},"youDecide":{"copy":"That’s using our criteria. The status of love songs depends on what <i>you</i> believe should or should not count as a love song. So, you decide: <b>remove categories <div class=\"remove-love-song-type-icon-within-text\"></div> based on your love song beliefs</b>, and tell <i>us</i> how the love song is doing!","figCaption":"SIXTIES_PERCENT% love songs in the 60s to MODERN_PERCENT% in the 2020s, visualized on a chart comparing the change of love song types over time, allowing you to add and remove each love song category and see how the proportion of all love songs changes over time based on that definition of what counts as a love song."},"footer":{"copy":"","figCaption":""}}}