{"title":"Is the Love Song Dying?","description":"We labeled all every love song in the Billboard Top 10 from 1959 through 2023 to see if love songs are truly on the decline.","url":"https://pudding.cool/2024/02/anthems","keywords":"billboard, pop music, love songs","byline":"By <a href=https://pudding.cool/author/david-mora/ target=_blank>David Mora</a> and <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>","dataMethodsModal":[],"stepText":{"haveYouSeenTheseYouTubeComments":"Have you ever seen a comment like this? They seem to be part of a larger sentiment: something about contemporary music is in decline.","boomerBobSaysLoveSongsAreDying":"This Baby Boomer-centric sentiment seems to crystalize around one topic in particular: modern pop music's treatment of love & romance -- or the lack thereof. According to Boomer Bob, the love song is dying. But is it true? Let's investigate...","titleCard":"","allTheBillboardHitsInAMonoChromeCluster":"Here are all 5,100 Billboard Top 10 hits from 1958 - September 2023. A each bubble is a song. The bigger the bubble, the longer it spent in the Top 10 (regardless of its exact rank).","highlightSerenadesWithinCluster":"These are the 1,040 Top 10 hits we think Boomer Bob would *definitely* consider love songs (labeled by hand and with ChatGPT[hover for more info]). All these songs are unmistakably about romantic love & devotion. They play at weddings & proms.","serenadesAreIndeedDying":"If you spread these classic love songs on a timeline, they are indeed declining...","serenadesPeakedInThe90s":"They peaked in the 90s with hits like 'I'll Make Love to You' by Boyz II Men...","aFewArtistsKeepThemAliveToday":"... then they waned. Today, only a few artists like Biebs & T-Swift champion them. But how much have these types of love songs dropped off, exactly?","anAggSnakeChartMakesBoomerBobSeemRight":"To see, here are the love songs as a proportion of all other Billboard Top 10 hits. The proportion of love songs in the 1960s was 23%. In the 2020s, it’s 12%. The proportion of love songs has almost halved! So, was Boomer Bob right? Are love songs, in fact, dying?","butWeWillTakeAMoreExpansiveView":"Not quite: we think Boomer Bob has too narrow of a view of love. Sure, these lovey-dovey tunes have declined. But what about other songs? What about 'I Will Always Love You' by Whitney Houston? Is 'Buy U A Drank' by T-Pain a love song? Or 'WAP'?","whyWeCare":"It's easy to just shake our fists and say, 'Kids these days don't value love anymore!' But, instead, if we challenge ourselves to look deeper at love songs -- and romance itself -- we uncover a far more complex (and fascinating) story. A story that will change how you see love in pop music. Let's dive in...","definingSerenades":"Earlier we showed you most obvious form of love songs, which we'll call 'Serenades'. They're typified by a simple relationship: you loves someone, and they love you back!","colorInHeartbreak":"But what happens if you love them, but they just... don't? Let's call this new type of sad love song 'Longing & Heartbreak.'","introducingLongingAndHeartbreak":"Think: The Beatle's 'Yesterday' or  Whitney Houston's 'I Will Always Love You'","longingAndHeartbreakComparedToSerenade":"Longing & Heartbreak surpassed Serenades in the 2020s, thanks in large part to 'Blinding Lights' by The Weeknd. Note: for each decade, we'll vertically sort the love song types by popularity (which is why Hearbreak jumps above Serenade in the 2020s).","longingAndHeartbreakDoNotTipTheScales":"Did adding Longing & Heartbreak save the love song? Nope! Their decline is still dramatic: from 45% of all songs in the 60s, to 27% in the 2020s.","introducingCourtship":"But we're just getting started... How about when you love someone, and it *might* become something more? You just spotted someone, your heart is beating fast, and who KNOWS where this thing might lead?","courtshipHasNoEffect":"But these 'Courtship & Anticipation' songs remain fairly steady over time. Meaning the love song is still in decline. So... was Boomer Bob right? I mean, what aspects of love could you sing about beyond new love, true love, & heartbreak?","introducingItsComplicated":"... a lot, if you're willing to explore the messier side of romance! Like what about when a relationship isn't clearly good *or* bad? Maybe you fight consantly. Maybe they're unfaithful. But you still try to make it work because... well, 'It's Complicated!'","itsComplicatedDoesNotTipTheScales":"Can this angsty genre save the love song? No, but we're getting closer!","introducingGoodRiddance":"Ok, so what about those songs where the relationship *is* clearly over, but the singer's heartbreak has resurrected into... righteous power? They're not crying, they're yelling 'Good Riddance'!","goodRiddanceDoesNotTipTheScale":"With the predominantly modern 'Good Riddance', maybe love's not dead... just little wounded?","introducingSexualConfidence":"But we can't call it just yet. What about these songs that get... a little steamy? Think artists like Nicki Minaj and Drake, who dominate this category.","sexualConfidenceInContext":"As Boomers bemoan, these 'Sexual Confidence' songs exploded in popularity, nearly eclipsing the Serenade in the 2000s. With this more sensual side of love, the modern love song seems *on par* with Boomer Bob's day! But we've got one more type left...","introducingLoveSongForTheSelf":"We've ventured *very* far from the Serenade. Far enough to finds its reincarnation: songs where heartbreak turns love back onto the OG, yourself. Like, 'You don't love me? That's ok, because I do! In fact, I'll by *myself* flowers...'","didLoveSongForTheSelfTipTheScales":"This women-pioneered 'Love Song for the Self' is the most modern of all the genres. And while it's not written *to* a lover, it's often written *in reaction to* romantic rejection. Ok... so where does it leave us? Is the love song dying?","theLoveSongIsActuallyRising":"... not at all, in fact it's actually *increased*! The love song didn't die, it evolved: people are loving, losing, and connecting in more ways than ever before. We think modern pop is just as romantic as ever, just maybe in ways that Boomer Bob doesn't recognize.","youDecide":"But, ultimately, the status of love songs depends on what *you* count as a love song. (Boomer Bob probably still only counts Serenades!) So, you decide: add and remove love songs based on your definition, and tell *us* how the love song is doing! (search specific songs or performers with the top bar)"}}