{"title":"Is the Love Song Dying?","description":"We categorized songs in the Billboard Top 10 to see if love songs are on the decline.","url":"https://pudding.cool/2024/09/love-songs","keywords":"billboard, pop music, love songs","byline":"By <a href=https://pudding.cool/author/david-mora/ target=_blank>David Mora</a> and <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>","footer":{"heading":"Thanks for reading!","thanks":"We, <a href=https://pudding.cool/author/david-mora/ target=_blank>David Mora</a> and <a href=https://pudding.cool/author/michelle-jia/ target=_blank>Michelle Jia</a>, would like to thank <a href=https://pudding.cool/author/michelle-pera-mcghee/ target=_blank>Michelle Pera-McGhee</a> for guiding us during our original pitch (about lyrical cliches in pop) that eventually became this piece, and <a href=https://pudding.cool/author/matt-daniels/ target=_blank>Matt Daniels</a> for his design and editorial guidance throughout.","methods":"Ok, fine, nerds: read about the methods and data here."},"dataMethods":[{"title":"How did you determine the popularity of each song?","paragraphs":["TLDR: popularity = number of weeks in the Billboard Top 10 (does not have to be continuous weeks)","Coming up with a popularity metric was tricky. First, Billboard continulsouly changed how they chose the rank of the Hot 100. In the ’60s, they loosely polled record stores, and sometimes just switched things up to keep it interesting. Later they started looking at stream count, which measures completely different user behavior (e.g., it takes into account those who listen to songs on repeat, which radio never could).","For example: You might notice that, as time goes on, there seem to be fewer songs, and songs on average spend longer in the Top 10. Are today’s songs just… more popular than ever? Unclear. It’s hard to know how much of this comes from changing listener behavior vs how Billboard measures listener bahvior. The best we can do is compare the relative popularity of a song to songs from the same era, since comparing across eras likely yields more signal than noise. It’s not safe to conclude, say, that Doja Cat’s “Kiss Me More” was more popular than The Beatle’s “Day Tripper” simply because it spent longer on the Top 10.","Second, even if Billboard rankings <i>were</i> made consistently, rankings (“ordinal measures,” for the geeks) kinda suck for deriving aggregate, quantitative comparisons. Billboard provides us each song’s rank, but nothing about how close or far one song was from another. For example, in January 2019, was Hasley’s “Without Me” at #1 because it was was twice as popular as Ariana’s “Thank U, Next” #2? Or did it barely edge it out?","The data is messy, so we ended up keeping our popularity metric simple: tally the total number of weeks the song was within the Top 10, irrespective of its specific rank. The popularity scores derived from this approach closely correlate with scoring methods that take rank into account, so we felt pretty happy proceeding with it."]},{"title":"How did you decide which of the 5,100 songs were love songs?","paragraphs":["We did a lot of labeling by hand. Once we had a solid approach (see below) and a lot of examples, we <a href=https://github.com/the-pudding/pop-love-songs/blob/main/GPT%20prompt%20used%20to%20label%20love%20song%20types.md target=_blank>wrote a prompt</a> and used GPT4o to label the rest. We iterated a lot on that prompt until it became pretty accurate. By the end, we found GPT made very few mistakes, and most mistakes we did find were simply songs that would have been genuinely ambiguous for a human labeler, as well.","I, David, was honestly very surprised by how accurate GPT4o ended up being, after a lot of experimentation. The experimentation pointed to a clear art to writing a good prompting. Model accuracy was most improved by: (a) in the output, having the model first write a justification before making its final categorization and (b) in the prompt, providing a lot of examples with justifications.","The explanation for this seems related to how LLMs work: since they generate outputs token by token, giving the model space to first “think through” a justification results in a more accurate classification. And, naturally, more examples increased the model’s clarity on our classification system."]},{"title":"[SPOILER ALERT] How did you develop and and then assign your seven love song types?","paragraphs":["TLDR: a ton of trial and error to determine categories that captured all songs and didn’t overlap; then a ton of trial and error using an LLM (GPT4o) to label them, reviewing the results, and iterating more on the system.","A bit more detail:","At our least structured, we were simply assessing the songs we saw, and adjusting categories to better match them.","At our most structured (and where we tried to start the process), we came up with a matrix made of two metrics. Here it is:","love-song-type-matrix-attempt.png","Here’s how it worked: Given love songs are fundamentally about the romantic dynamics between (at least) two people, the first metric defined the relationship between the speaker and their subject: the speaker has/had feelings toward someone, and they either (a) might love them back, (b) do love them back or (c) don’t love them back (but might have once). The second metric was how traditional the treatment of love was. As you can see, the less traditional love song types often straddle multiple relationship categories.","In the end, we felt the framework was more confusing than helpful, but it helped us land on our ultimate love song categories."]},{"title":"Besides what you did by hand and with an LLM, here did you get your data?","paragraphs":["From <a href=https://github.com/utdata/rwd-billboard-data/blob/main/data-out/hot-100-current.csv target=_blank>this scrape of weekly Billboard Hot 100 rankings</a> we looked at songs from 1959 - September 2023 (the cutoff date was chosen to be safety within the window that OpenAI’s GPT4o was trained on). There are 5,141 unique songs.","We used GPT to split out individual artist artists from the credit of each song. We merged some names where there was variation in the same artist’s name or spelling (eg Jay-Z and JAY-Z)."]}],"commentText":{"boomerBobComment":"They don't make love songs like they used to… Nowadays it's just sex, drugs and me me me!!!","alternate":"They don’t make love songs like they used to… No cussing, no nudity, just pure talent!"},"stepText":{"haveYouSeenTheseYouTubeComments":"Have you ever seen a comment like this? They seem to be part of a larger sentiment: something about contemporary music is in decline.","boomerBobSaysLoveSongsAreDying":"This Baby Boomer-centric sentiment seems to crystallize around one topic in particular: modern pop music’s treatment of love & romance—or the lack thereof. According to Boomer Bob, the love song is dying. But is it true? Let’s investigate...","titleCard":"","allTheBillboardHitsInAMonoChromeCluster":"Here are all 5,100 Billboard Top 10 hits from 1958 to September 2023. Each bubble (<span class=in-text-bubble-example></span>) is a song. The bigger the bubble, the longer it spent in the Top 10, regardless of its exact rank. <button class=modalTrigger>Learn more about our methods</button>.","highlightSerenadesWithinCluster":"These are the 1,040 Top 10 hits we think Boomer Bob would <i>definitely</i> consider love songs. They’re all unmistakably about romantic love and devotion, sung from one person to another. Let's call these <span class=serenade>Serenades</span>.","serenadesAreIndeedDying":"If you spread these <span class=serenade>Serenades</span> on a timeline, they <i>do</i> appear to decline… but by how much?","serenadesPeakedInThe90s":"If you spread these classic love songs on a timeline, you see them peak in the ’90s with hits like “I'll Make Love to You” by Boyz II Men...","aFewArtistsKeepThemAliveToday":"... then they wane. Today, only a few artists, such as Justin Bieber and Taylor Swift, consistently chart with classic love songs. But how much have these types of love songs dropped off, exactly?","anAggSnakeChartMakesBoomerBobSeemRight":"To see, here are the <span class=serenade>Serenades</span> as a proportion of <span class=not-a-love-song>all other Billboard Top 10 hits</span>. The proportion of love songs in the 1960s was <b>23%</b>. In the 2020s, it’s <b>12%</b>. The proportion of love songs has almost halved! So, was Boomer Bob right? Are love songs, in fact, dying?","butWeWillTakeAMoreExpansiveView":"Not quite: we think Boomer Bob has too narrow of a view of love. Sure, these lovey-dovey tunes have declined. But what about other songs? What about “I Will Always Love You”? Or T-Pain’s “Buy U A Drank”? Or “WAP?” If we look more closely, we uncover a story that will change how you see love in pop music.","whyWeCare":"It's easy to just shake our fists and say, “Kids these days don’t value love anymore!” But, instead, if we challenge ourselves to look deeper at love songs—and romance itself—we uncover a far more complex (and fascinating) story. A story that will change how you see love in pop music.","definingSerenades":"Earlier we showed you the most obvious form of love songs, the <span class=serenade>Serenade</span>. These songs describe a simple relationship: you love someone, and they love you back!","colorInHeartbreak":"But what happens if you love them, but they just... don’t? Let’s call this type of love song <span class=longing-and-heartbreak>Longing & Heartbreak</span>.","introducingLongingAndHeartbreak":"Taylor Swift and Mariah Carey top the <span class=longing-and-heartbreak>Longing & Heartbreak</span> category.","longingAndHeartbreakComparedToSerenade":"The total number of Top 10 spots occupied by <span class=longing-and-heartbreak>Longing & Heartbreak</span> surpassed <span class=serenade>Serenades</span> in the 2020s. “Blinding Lights” by The Weeknd played a big role, spending 57 weeks in the Top 10. Note: for each decade, love song types are sorted vertically by popularity (which is why <span class=longing-and-heartbreak>Longing & Heartbreak</span> jumps above <span class=serenade>Serenades</span> in the 2020s).","longingAndHeartbreakDoNotTipTheScales":"Did adding <span class=longing-and-heartbreak>Longing & Heartbreak</span> save the love song? Nope! Their decline is still dramatic: from <b>45%</b> of all songs in the ’60s, to <b>27%</b> in the 2020s.","introducingCourtship":"But we’re just getting started... How about when you love someone, and it  <i>might </i> become something more? You just spotted someone, your heart is beating fast, and who KNOWS where this thing might lead?","courtshipHasNoEffect":"These <span class=courtship-and-anticipation>Courtship & Anticipation</span> songs remain fairly steady over time, so the love song is still in decline and Boomer Boomer Bob remains right. I mean, what aspects of love could you sing about beyond <span class=courtship-and-anticipation>new love</span>, <span class=serenade>true love</span>, and <span class=longing-and-heartbreak>heartbreak</span>?","introducingItsComplicated":"From our perspective: a lot, if you’re willing to explore the messier side of romance. What about when a relationship isn’t clearly good <i>or</i> bad? Maybe you fight constantly. Maybe they’re unfaithful. But you still try to make it work, because... well, <span class=\"its-complicated\">It's Complicated</span>!","itsComplicatedDoesNotTipTheScales":"Can this angst-y genre save the love song? No, but we’re getting closer!","introducingGoodRiddance":"What about those songs where the relationship  <i>is </i> clearly over, but the songwriter’s heartbreak has resurrected into... righteous power? They’re not crying, they’re yelling “<span class=\"good-riddance\">Good Riddance</span>!”","goodRiddanceDoesNotTipTheScale":"With the predominantly modern <span class=\"good-riddance\">Good Riddance</span> love song, maybe love is not dead; it’s just a little wounded.","introducingSexualConfidence":"What about songs that get a little steamy? Think artists like Nicki Minaj and Drake, who dominate this category.","sexualConfidenceInContext":"As Boomers bemoan, these <span class=\"sexual-confidence\">Sexual Confidence</span> songs exploded in popularity, nearly eclipsing the Serenade in the 2000s. When we include this sensual side of love, the love song isn’t dying after all, but  just as popular as in Boomer Bob’s day! But we’re not done quite yet.","introducingLoveSongForTheSelf":"We’ve ventured  <i>very</i> far from the <span class=serenade>Serenade</span>. Far enough to find its reincarnation: songs where heartbreak turns love back onto the OG, yourself. “You don't love me? That’s ok, because I do! In fact, I’ll buy <i>myself</i> flowers…”","didLoveSongForTheSelfTipTheScales":"This women-pioneered <span class=\"love-song-for-the-self\">Love Song for the Self</span> is the most modern of all the genres. And while it’s not written <i>to</i> a lover, it’s often written in <i>reaction to</i> romantic rejection. Let’s return to our central question: Is the love song dying?","theLoveSongIsActuallyRising":"Not at all. In fact, it’s increasingly <b>more popular</b>! The love song didn’t die; it evolved. People are loving, losing, and connecting in more ways than ever before. We argue that <b>modern pop is just as romantic as ever</b>, just maybe in ways that Boomer Bob doesn’t recognize.","youDecide":"That’s using our criteria. The status of love songs depends on what <i>you</i> believe should or should not count as a love song. So, you decide: <b>remove categories (<div class=\"remove-love-song-type-icon-within-text\"></div>) based on your love song beliefs</b>, and tell <i>us</i> how the love song is doing!"}}